package class_one;

public class HexadecimalConversion{
    protected static void main(String[] args){
        /*
        10
        5 0
        2 1
        1 0
        0 1
        -8
        0000 1000
        1111 0111
        1111 1000

        -3
        0000 0011
        1111 1100
        1111 1101
        */

        /*
        1011.01 = 1*2^3 + 0*2^2 + 1*2^1 + 1*2^0 + 0*2^-1 + 1*2^-2
        = 8+0+2+1+0+0.25
        =10.25
        */

        /*
        整数部分："除二取余，逆序排列"
        小数部分："乘二取整，顺序排列"
        */
        /*
        25
        12 1
        6 0
        3 0
        1 1
        0 1
        11001

        0.25
        0.5
        1.0

        0.01
        */
    }
}